In [2]:
import numpy as np
import pandas as pd

In [3]:
ind = ['r1','r2','r3','r4','r5','r6']
col = ['c1','c2','c3','c4','c5','c6']


data=np.arange(1,37).reshape(6,6)

df= pd.DataFrame(data=data,index=ind,columns=col)
df

    c1  c2  c3  c4  c5  c6
r1   1   2   3   4   5   6
r2   7   8   9  10  11  12
r3  13  14  15  16  17  18
r4  19  20  21  22  23  24
r5  25  26  27  28  29  30
r6  31  32  33  34  35  36

In [4]:
df[['c1','c2']]

    c1  c2
r1   1   2
r2   7   8
r3  13  14
r4  19  20
r5  25  26
r6  31  32

In [5]:
df.iloc[:,[2,3,4]]

    c3  c4  c5
r1   3   4   5
r2   9  10  11
r3  15  16  17
r4  21  22  23
r5  27  28  29
r6  33  34  35

In [8]:
selector=df.iloc[[0,4,5],[0,1,4]]
selector

    c1  c2  c5
r1   1   2   5
r5  25  26  29
r6  31  32  35

In [9]:
df.iloc[0:3,0:3]

    c1  c2  c3
r1   1   2   3
r2   7   8   9
r3  13  14  15

In [14]:
climate_data={
    'Day':['1/11/2025','2/11/2025','3/11/2025','4/11/2025','5/11/2025'],
    'Temperature':[30,32,31,29,28],
    'Wind_Speed':[10,12,11,9,8],
    'Event':['Sunny','Rainy','Cloudy','Cloudy','Cloudy']
}

df=pd.DataFrame(climate_data)
df

         Day  Temperature  Wind_Speed   Event
0  1/11/2025           30          10   Sunny
1  2/11/2025           32          12   Rainy
2  3/11/2025           31          11  Cloudy
3  4/11/2025           29           9  Cloudy
4  5/11/2025           28           8  Cloudy

In [15]:
df=pd.DataFrame(data=climate_data)
df

         Day  Temperature  Wind_Speed   Event
0  1/11/2025           30          10   Sunny
1  2/11/2025           32          12   Rainy
2  3/11/2025           31          11  Cloudy
3  4/11/2025           29           9  Cloudy
4  5/11/2025           28           8  Cloudy